<?php
/**
 * Created by PhpStorm.
 * User: huanghaitao
 * Date: 15/10/19
 * Time: 上午8:53
 */

return array(
    40001 => '请填写完整信息',
    40002 => '参数格式错误',
    40003 => '签名验证失败',
    40004 => '资源不存在',
    40005 => '模块错误',
    40006 => '方法错误',
    40007 => 'App验证失败',


    50001 => 'device_identifier 已经存在',
    50002 => 'device_identifier 注册错误',

    51000 => '验证吗错误',
    51001 => '手机号码已经注册',
    51002 => '用户注册失败',
    51003 => '请输入昵称4-20个字符',
    51004 => '用户名或者密码错误',
    51005 => '用户尚未登陆，请先登陆',
    51006 => '用户字段不存在',
    51007 => '用户修改信息失败',
    51008 => '第三方登录需要完善信息',


    60001 => '用户已经添加车辆',
    60002 => '用户添加车辆出错',
    60003 => '请填写VIN码或者上传行驶证',
    60004 => '请填写车辆品牌',
    60005 => '请填写车辆系列',
    60006 => '请填写车辆型号',
    60007 => '车辆不存在',
    60008 => '请选择车型',
    60009 => '请填写车辆价格',
    60010 => '请填写首次上牌时间',
    60011 => '请填写行驶公里数',
    60012 => '请填写使用情况',
    60013 => '请填写车辆所在城市',
    60014 => '请填写车辆颜色',
    60015 => '请填写车牌号',
    60016 => '请填写联系人姓名',
    60017 => '请填写看车地址',
    60018 => '请填写车辆保养情况',
    60019 => '请填写是否包含过户费',
    60020 => '请填写保险到期时间',
    60021 => '请填写年检到期时间',
    60022 => '请填写车辆简介',
    60023 => '请填写过户次数',
    60024 => '请上传爱车照片',

    61000 => '收藏失败',
    61001 => '已经收藏该车辆',

    //post

    62001 => '亲，上传图片更容易吸引关注哦!',

    66001 => '不允许对自己评论回复',

    66002 => '消息不存在',

    67000 => '亲,您已经赞过了.',
    67001 => '亲,您已经取消赞了.',

    //qiniu
    70001 => '第三方上传文件失败',



);