<?php
/**
 * Created by PhpStorm.
 * User: huanghaitao
 * Date: 15/10/19
 * Time: 上午8:53
 */

return array(
    40001 => '参数不全',
    40002 => '参数格式错误',
    40003 => '签名验证失败',
    40004 => '资源不存在',
    40005 => '模块错误',
    40006 => '方法错误',
    40007 => 'App验证失败',


    50001 => 'device_identifier 已经存在',
    50002 => 'device_identifier 注册错误',

    51000 => '验证吗错误',
    51001 => '手机号码已经注册',
    51002 => '用户注册失败',
    51003 => '请输入昵称6-20个字符',
    51004 => '用户登录失败',
    51005 => '用户验证失败',
    51006 => '用户字段不存在',
    51007 => '用户修改信息失败',


    60001 => '用户已经添加车辆',
    60002 => '用户添加车辆出错',
    60003 => '请填写VIN码或者上传行驶证',


    //qiniu
    70001 => '第三方上传文件失败',

);